# Membuat Database MySQL Berbantuan Python

## Pengantar
MySQL adalah sebuah DBMS (Database Management System) menggunakan perintah SQL (Structured Query Language) yang banyak digunakan saat ini dalam pembuatan aplikasi berbasis website. MySQL dibagi menjadi dua lisensi, pertama adalah Free Software dimana perangkat lunak dapat diakses oleh siapa saja. Kedua adalah Shareware dimana perangkat lunak berpemilik memiliki batasan dalam penggunaannya. MySQL termasuk ke dalam RDBMS (Relational Database Management System). Sehingga, menggunakan tabel, kolom, baris, di dalam struktur database-nya. Jadi, dalam proses pengambilan data menggunakan metode relational database serta menjadi penghubung antara perangkat lunak dan database server.

## Objektif 
Database dapat dianalogikan sebuah folder dalam komputer kita, yang didalamnya berisi file-file yang dapat menyimpan informasi. Dalam konteks database, file-file tersebut kita kenal dengan istilah table. Misal saja kita dihadapkan dengan suatu kebutuhan untuk membuat sebuah database untuk suatu usaha atau toko, kita sebut saja database yang akan kita buat dengan `toko_rizzz`. Dalam database tersebut akan terdapat beberapa table, yaitu `pelanggan`, `barang`, `transaksi`, dan `pengiriman`. Di dalam table-table tersebut akan terdapat kolom-kolom yang digunakan untuk menyimpan informasi. Informasi tersebut dapat diakses jika suatu saat dibutuhkan.

## Proses Pembuatan Database

### Membuat Database baru di MySQL
Untuk membuat database baru, disini kita akan memanfaatkan bantuan dari python dengan menggunakan package `mysql-connector`.

In [1]:
import mysql.connector as mysql

Jika belum memiliki package di atas, silahkan uncomment dan eksekusi statement di bawah ini!

In [2]:
# !pip install mysql-connector-python

Kemudian kita menghubungkan server MySQL dengan python dengan memasukkan user, password, host, port, dan databases yang akan kita bungkus dalam object `db` dengan cara seperti di bawah ini:

In [3]:
db = mysql.connect(
    user = 'root',
    password = '1234',
    host     = 'localhost',
    port     = 3306,
    database = ''
    )

Disini nama user kita adalah `root` dengan password `1234` dengan host `localhost` dan port `3306`. Untuk database kita kosongkan karena kita akan membuat database baru. Dalam MySQL, jika kita ingin membuat database baru (dalam kasus ini, kita akan membuat database `toko_rizzz`), kita dapat mengeksekusi QUERY berikut:

> CREATE DATABASE toko_rizzz

Untuk mengeksekusi QUERY tersebut dengan python, kita perlu menggunakan method `cursor()` dari object `db` yang akan kita tampung dalam variable `cursor` seperti di bawah ini:

In [4]:
cursor = db.cursor()

Setelah itu kita dapat mengeksekusi QUERY di atas dengan method `execute()` dari object `cursor` seperti berikut ini:

In [5]:
query = '''
        CREATE DATABASE toko_rizzz
'''

cursor.execute(query)

Setelah dieksekusi, maka kita telah berhasil membuat database baru bernama `toko_rizzz`.

### Membuat Table dalam Database 
Database yang telah kita buat di atas masih kosong, belum terdapat satu table pun. Disini kita perlu membuat table untuk mengisi database kita. Seperti yang kita telah disebutkan di atas, kita akan membuat beberapa table, yaitu `pelanggan`, `barang`, dan `transaksi`. Namun sebelum itu, kita perlu menghubungkan python dengan database `toko_rizzz` kita.

In [6]:
db = mysql.connect(
    user = 'root',
    password = '1234',
    host     = 'localhost',
    port     = 3306,
    database = 'toko_rizzz'
    )

cursor = db.cursor()

parameter `database` yang tadi kita kosongkan, sekarang kita isi dengan nama database kita, yaitu `toko_rizzz`.

#### Membuat Table `pelanggan` 
Kita akan membuat table pelanggan yang di dalamnya berisi beberapa kolom informasi yaitu `id_pelanggan`, `nama_pelanggan`, dan `email_pelanggan`, maka kita perlu mengeksekusi QUERY berikut ini:

In [7]:
query = '''
    create table pelanggan(
        id_pelanggan varchar(20) not null,
        nama_pelanggan varchar(40),
        email_pelanggan varchar(50),
        primary key(id_pelanggan)
    )
'''

cursor.execute(query)

#### Membuat Table `barang` 
Kita akan membuat table barang yang di dalamnya berisi beberapa kolom informasi yaitu `id_barang`, `nama_barang`, `jenis_barang` dan `harga_barang`, maka kita perlu mengeksekusi QUERY berikut ini:

In [8]:
query = '''
    create table barang(
        id_barang varchar(20) not null,
        nama_barang varchar(40),
        jenis_barang varchar(50),
        harga_barang int,
        primary key(id_barang)
    )
'''

cursor.execute(query)

#### Membuat Table `transaksi` 
Kita akan membuat table transaksi yang di dalamnya berisi beberapa kolom informasi yaitu `id_transaksi`, `tanggal_transaksi`, `id_pelanggan`, `id_barang`, `jumlah_pembelian` dan `total_harga`, maka kita perlu mengeksekusi QUERY berikut ini:

In [9]:
query = '''
    create table transaksi(
        id_transaksi varchar(20) not null,
        tanggal_transaksi date,
        id_pelanggan varchar(20),
        id_barang varchar(20),
        jumlah_pembelian int,
        total_harga int,
        primary key(id_transaksi)
    )
'''

cursor.execute(query)

### Memasukkan Nilai Pada Table 
Kita telah selesai membuat database dan dalam database tersebut sudah kita isikan beberapa table. Namun table-table tersebut masih kosong, belum terdapat nilai di dalamnya. Kita akan memasukan nilai ke dalam masing-masing table dengan nilai yang kita hasilkan secara random menggunakan bantuan package `random`. Kita juga akan menggunakan bantuan package `pandas` untuk melihat secara sekilas bagaimana tampilan isi table.

In [10]:
import random as r
import pandas as pd

#### Memasukkan Nilai pada Table `pelanggan`
Table pelanggan  berisi beberapa kolom informasi yaitu `id_pelanggan`, `nama_pelanggan`, dan `email_pelanggan`. Kolom `nama_pelanggan` akan diisi dengan beberapa sample nama di bawah ini, kolom `email_pelanggan` akan dihasilkan nilai berdasarkan nama pelanggan yang disusun tanpa spasi dengan huruf non kapital diikuti string "@email.com", sedangkan kolom `id_pelanggan` akan dihasilkan dengan string berpola "PELANGGAN-000[INT]".

In [11]:
nama_pelanggan_unik = ['Julia Robertson', 'Michael Bow', 'Sisca Johanson', 'Frank Yhou', 'Stephen Lambert', 'Johnny Ward', 'Rafael Bautista', 'Jeremy Gusto', 'Vladimir Cheysev', 'Robin Powell']

In [12]:
id_pelanggan_unik = [f'PELANGGAN-000{i}' for i in range(len(nama_pelanggan_unik))]

In [13]:
# nama_pelanggan = [r.choice(nama_pelanggan_unik) for i in range(10000)]

# email_pelanggan = [email_pelanggan_unik[nama_pelanggan_unik.index(nama_pelanggan[i])] for i in range(10000)]

In [14]:
email_pelanggan_unik = [f'{(nama_pelanggan_unik[i].lower()).replace(" ", "")}@email.com' for i in range(len(nama_pelanggan_unik))]

Data tersebut akan kita jadikan dictionary kemudian kita convert menjadi pandas dataframe seperti pada berikut ini:

In [15]:
data_pelanggan = {
    'id_pelanggan' : id_pelanggan_unik,
    'nama_pelanggan' : nama_pelanggan_unik,
    'email_pelanggan' : email_pelanggan_unik
}

df_pelanggan = pd.DataFrame(data_pelanggan)
df_pelanggan

     id_pelanggan    nama_pelanggan            email_pelanggan
0  PELANGGAN-0000   Julia Robertson   juliarobertson@email.com
1  PELANGGAN-0001       Michael Bow       michaelbow@email.com
2  PELANGGAN-0002    Sisca Johanson    siscajohanson@email.com
3  PELANGGAN-0003        Frank Yhou        frankyhou@email.com
4  PELANGGAN-0004   Stephen Lambert   stephenlambert@email.com
5  PELANGGAN-0005       Johnny Ward       johnnyward@email.com
6  PELANGGAN-0006   Rafael Bautista   rafaelbautista@email.com
7  PELANGGAN-0007      Jeremy Gusto      jeremygusto@email.com
8  PELANGGAN-0008  Vladimir Cheysev  vladimircheysev@email.com
9  PELANGGAN-0009      Robin Powell      robinpowell@email.com

Kira-kira seperti di ataslah tampilan isi dari table `pelanggan`. Selanjutkan kita akan memasukan nilai di atas pada table `pelanggan` kita dengan query dan looping seperti berikut:

In [16]:
for i in range(len(df_pelanggan)):
    
    query = f'''
        insert into pelanggan
        values('{df_pelanggan['id_pelanggan'].loc[i]}', '{df_pelanggan['nama_pelanggan'].loc[i]}', '{df_pelanggan['email_pelanggan'].loc[i]}')
    '''
    
    cursor.execute(query)
db.commit()

Setelah dieksekusi, maka kita telah berhasil memasukkan nilai dalam table `pelanggan`

#### Memasukkan Nilai pada Table `barang`
Table barang berisi beberapa kolom informasi yaitu `id_barang`, `nama_barang`, `jenis_barang`, dan `harga_barang`. Kolom `nama_barang`, `jenis_barang`, dan `harga_barang` akan diisi seperti pada tabel di bawah ini:

| nama_barang | jenis_barang | harga_garang |
| ----------- | ------------ | ------------ |
| pasta gigi  | alat mandi   | 12000        |
| sabun       | alat mandi   | 7000         |
| shampoo     | alat mandi   | 5000         |
| tepung      | bahan makan  | 10000        |
| garam       | bahan makan  | 3000         |
| gula        | bahan makan  | 4000         |
| kalung      | aksesoris    | 50000        |
| anting      | aksesoris    | 20000        |
| gelang      | aksesoris    | 15000        |

sedangkan kolom `id_barang` akan dihasilkan dengan string berpola "BARANG-000[INT]".

In [17]:
nama_barang_unik = ['pasta gigi', 'sabun', 'shampoo', 'tepung', 'garam', 'gula', 'kalung', 'anting', 'gelang']

In [18]:
harga_barang_unik = [12000, 7000, 5000, 10000, 3000, 4000, 50000, 20000, 15000]

In [19]:
jenis_barang = ['alat mandi', 'alat mandi', 'alat mandi', 'bahan makan', 'bahan makan', 'bahan makan', 'aksesoris', 'aksesoris', 'aksesoris']

In [20]:
id_barang_unik = [f'BARANG-000{i}' for i in range(len(nama_barang_unik))]

Data tersebut akan kita jadikan dictionary kemudian kita convert menjadi pandas dataframe seperti pada berikut ini:

In [21]:
data_barang = {
    'id_barang' : id_barang_unik,
    'nama_barang' : nama_barang_unik,
    'jenis_barang' : jenis_barang,
    'harga_barang' : harga_barang_unik
}

df_barang = pd.DataFrame(data_barang)
df_barang

     id_barang nama_barang jenis_barang  harga_barang
0  BARANG-0000  pasta gigi   alat mandi         12000
1  BARANG-0001       sabun   alat mandi          7000
2  BARANG-0002     shampoo   alat mandi          5000
3  BARANG-0003      tepung  bahan makan         10000
4  BARANG-0004       garam  bahan makan          3000
5  BARANG-0005        gula  bahan makan          4000
6  BARANG-0006      kalung    aksesoris         50000
7  BARANG-0007      anting    aksesoris         20000
8  BARANG-0008      gelang    aksesoris         15000

Kira-kira seperti di ataslah tampilan isi dari table `barang`. Selanjutkan kita akan memasukan nilai di atas pada table `barang` kita dengan query dan looping seperti berikut:

In [22]:
for i in range(len(df_barang)):
    
    query = f'''
        insert into barang
        values('{df_barang['id_barang'].loc[i]}', '{df_barang['nama_barang'].loc[i]}', '{df_barang['jenis_barang'].loc[i]}', {df_barang['harga_barang'].loc[i]})
    '''
    
    cursor.execute(query)
db.commit()

Setelah dieksekusi, maka kita telah berhasil memasukkan nilai dalam table `barang`

#### Memasukkan Nilai pada Table `transaksi`
Table barang berisi beberapa kolom informasi yaitu `id_transaksi`, `tanggal_transaksi`, `id_pelanggan`, `id_barang`, `jumlah_pembelian` dan `total_harga`. Kolom `tanggal_transaksi` akan dihasilkan nilai secara random dalam format YYYY-MM-DD. Kolom `id_pelanggan` dan `id_barang`, dan `jumlah_pembelian` akan dihasilkan nilai dengan pengambilan secara random dengan peletakkan kembali (with replacement) dari variable `id_pelanggan_unik` dan `id_barang_unik` di atas. Kolom `jumlah_pembelian` akan dihasilkan nilai bilangan bulat random. Kolom `total_harga` akan diisi dengan hasil perkalian jumlah pembelian dengan harga barang. Sedangkan kolom `id_barang` akan dihasilkan dengan string berpola "TRANSAKSI-000[INT]". Table `transaksi` akan membuat 10000 baris data.

In [23]:
id_transaksi_unik = [f'TRANSAKSI-000{i}' for i in range(10000)]

In [24]:
import datetime as dt

tanggal_transaksi = [dt.date(r.randint(2018,2023), r.randint(1,12), r.randint(1,28)) for i in range(10000)]

In [25]:
id_pelanggan = [r.choice(id_pelanggan_unik) for i in range(10000)]

In [26]:
id_barang = [r.choice(id_barang_unik) for i in range(10000)]

In [27]:
jumlah_pembelian = [r.randint(1,20) for i in range(10000)]

In [28]:
total_harga = [jumlah_pembelian[i] *  harga_barang_unik[id_barang_unik.index(id_barang[i])] for i in range(10000)]

Data tersebut akan kita jadikan dictionary kemudian kita convert menjadi pandas dataframe seperti pada berikut ini:

In [29]:
data_transaksi = {
    'id_transaksi' : id_transaksi_unik,
    'tanggal_transaksi' : tanggal_transaksi,
    'id_pelanggan' : id_pelanggan,
    'id_barang' : id_barang,
    'jumlah_pembelian' : jumlah_pembelian,
    'total_harga' : total_harga
}

df_transaksi = pd.DataFrame(data_transaksi)
df_transaksi

,id_transaksi,tanggal_transaksi,id_pelanggan,id_barang,jumlah_pembelian,total_harga
0,TRANSAKSI-0000,2020-09-22,PELANGGAN-0004,BARANG-0007,4,80000
1,TRANSAKSI-0001,2019-08-12,PELANGGAN-0003,BARANG-0000,6,72000
2,TRANSAKSI-0002,2020-06-13,PELANGGAN-0002,BARANG-0000,17,204000
3,TRANSAKSI-0003,2018-01-24,PELANGGAN-0008,BARANG-0003,9,90000
4,TRANSAKSI-0004,2023-10-06,PELANGGAN-0003,BARANG-0005,8,32000
...,...,...,...,...,...,...
9995,TRANSAKSI-0009995,2019-04-14,PELANGGAN-0002,BARANG-0003,5,50000
9996,TRANSAKSI-0009996,2018-07-05,PELANGGAN-0003,BARANG-0005,5,20000
9997,TRANSAKSI-0009997,2021-08-19,PELANGGAN-0005,BARANG-0007,14,280000
9998,TRANSAKSI-0009998,2018-02-04,PELANGGAN-0000,BARANG-0001,14,98000
9999,TRANSAKSI-0009999,2022-05-10,PELANGGAN-0007,BARANG-0007,11,220000

Kira-kira seperti di ataslah tampilan isi dari table `transaksi`. Selanjutkan kita akan memasukan nilai di atas pada table `transaksi` kita dengan query dan looping seperti berikut:

In [30]:
for i in range(len(df_transaksi)):
    
    query = f'''
        insert into transaksi
        values('{df_transaksi['id_transaksi'].loc[i]}', '{df_transaksi['tanggal_transaksi'].loc[i]}', '{df_transaksi['id_pelanggan'].loc[i]}', '{df_transaksi['id_barang'].loc[i]}', {df_transaksi['jumlah_pembelian'].loc[i]}, {df_transaksi['total_harga'].loc[i]})
    '''
    
    cursor.execute(query)
db.commit()

Setelah dieksekusi, maka kita telah berhasil memasukkan nilai dalam table `transaksi`

## Demonstrasi Database
Kita telah selesai membuat database beserta isi di dalamnya. Sekarang kita akan menampilkan database yang telah kita buat. Hal ini bisa dilakukan dengan bantuan `pandas`.

### Menampilkan Semua Table dalam Database

In [31]:
query = '''

    SHOW TABLES
    
'''

pd.read_sql(query, db)

C:\Users\Rizzz Maooo\AppData\Local\Temp\ipykernel_2196\2527271145.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, db)

  Tables_in_toko_rizzz
0               barang
1            pelanggan
2            transaksi

### Menampilkan Isi dari Tabel `barang`

In [32]:
query = '''

    SELECT * FROM barang
    
'''

pd.read_sql(query, db)

C:\Users\Rizzz Maooo\AppData\Local\Temp\ipykernel_2196\3196521575.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, db)

     id_barang nama_barang jenis_barang  harga_barang
0  BARANG-0000  pasta gigi   alat mandi         12000
1  BARANG-0001       sabun   alat mandi          7000
2  BARANG-0002     shampoo   alat mandi          5000
3  BARANG-0003      tepung  bahan makan         10000
4  BARANG-0004       garam  bahan makan          3000
5  BARANG-0005        gula  bahan makan          4000
6  BARANG-0006      kalung    aksesoris         50000
7  BARANG-0007      anting    aksesoris         20000
8  BARANG-0008      gelang    aksesoris         15000

## Menampilkan Isi dari Tabel `pelanggan`

In [33]:
query = '''

    SELECT * FROM pelanggan
    
'''

pd.read_sql(query, db)

C:\Users\Rizzz Maooo\AppData\Local\Temp\ipykernel_2196\1434194026.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, db)

     id_pelanggan    nama_pelanggan            email_pelanggan
0  PELANGGAN-0000   Julia Robertson   juliarobertson@email.com
1  PELANGGAN-0001       Michael Bow       michaelbow@email.com
2  PELANGGAN-0002    Sisca Johanson    siscajohanson@email.com
3  PELANGGAN-0003        Frank Yhou        frankyhou@email.com
4  PELANGGAN-0004   Stephen Lambert   stephenlambert@email.com
5  PELANGGAN-0005       Johnny Ward       johnnyward@email.com
6  PELANGGAN-0006   Rafael Bautista   rafaelbautista@email.com
7  PELANGGAN-0007      Jeremy Gusto      jeremygusto@email.com
8  PELANGGAN-0008  Vladimir Cheysev  vladimircheysev@email.com
9  PELANGGAN-0009      Robin Powell      robinpowell@email.com

### Menampilkan Isi dari Tabel `transaksi`

In [34]:
query = '''

    SELECT * FROM transaksi
    
'''

pd.read_sql(query, db)

C:\Users\Rizzz Maooo\AppData\Local\Temp\ipykernel_2196\1553775412.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql(query, db)

,id_transaksi,tanggal_transaksi,id_pelanggan,id_barang,jumlah_pembelian,total_harga
0,TRANSAKSI-0000,2020-09-22,PELANGGAN-0004,BARANG-0007,4,80000
1,TRANSAKSI-0001,2019-08-12,PELANGGAN-0003,BARANG-0000,6,72000
2,TRANSAKSI-00010,2019-08-22,PELANGGAN-0009,BARANG-0002,18,90000
3,TRANSAKSI-000100,2021-06-06,PELANGGAN-0003,BARANG-0008,8,120000
4,TRANSAKSI-0001000,2023-01-22,PELANGGAN-0008,BARANG-0001,13,91000
...,...,...,...,...,...,...
9995,TRANSAKSI-0009995,2019-04-14,PELANGGAN-0002,BARANG-0003,5,50000
9996,TRANSAKSI-0009996,2018-07-05,PELANGGAN-0003,BARANG-0005,5,20000
9997,TRANSAKSI-0009997,2021-08-19,PELANGGAN-0005,BARANG-0007,14,280000
9998,TRANSAKSI-0009998,2018-02-04,PELANGGAN-0000,BARANG-0001,14,98000
9999,TRANSAKSI-0009999,2022-05-10,PELANGGAN-0007,BARANG-0007,11,220000